logs/20240610-061140-dummy_file.00003339/iodepth=16/rw=write/fio.log
job: (g=0): rw=write, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=16
fio-3.35
Starting 1 process
fio: pid=91968, err=28/file:io_u.c:1889, func=io_u error, error=No space left on device

job: (groupid=0, jobs=1): err=28 (file:io_u.c:1889, func=io_u error, error=No space left on device): pid=91968: Mon Jun 10 06:35:44 2024
  write: IOPS=88, BW=44.2MiB/s (46.3MB/s)(9156MiB/207197msec); 0 zone resets
    slat (usec): min=25, max=147444, avg=203.24, stdev=2907.37
    clat (msec): min=9, max=593, avg=180.76, stdev=78.74
     lat (msec): min=9, max=594, avg=180.96, stdev=78.78
    clat percentiles (msec):
     |  1.00th=[   31],  5.00th=[   42], 10.00th=[   80], 20.00th=[  122],
     | 30.00th=[  142], 40.00th=[  161], 50.00th=[  178], 60.00th=[  194],
     | 70.00th=[  218], 80.00th=[  243], 90.00th=[  284], 95.00th=[  321],
     | 99.00th=[  388], 99.50th=[  422], 99.90th=[  481], 99.95th=[  510],
     | 99.99th=[  567]
   bw (  KiB/s): min=16384, max=71680, per=100.00%, avg=45302.00, stdev=8590.80, samples=414
   iops        : min=   32, max=  140, avg=88.45, stdev=16.78, samples=414
  lat (msec)   : 10=0.03%, 20=0.10%, 50=6.77%, 100=6.47%, 250=69.66%
  lat (msec)   : 500=16.82%, 750=0.08%
  cpu          : usr=0.19%, sys=0.64%, ctx=4368, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,18325,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=44.2MiB/s (46.3MB/s), 44.2MiB/s-44.2MiB/s (46.3MB/s-46.3MB/s), io=9156MiB (9600MB), run=207197-207197msec

Disk stats (read/write):
    md127: ios=0/19673, merge=0/0, ticks=0/3457977, in_queue=3457977, util=98.73%, aggrios=4711/11443, aggrmerge=148082/422564, aggrticks=149183/182461, aggrin_queue=415906, aggrutil=65.39%
  sdf: ios=4394/12202, merge=145825/449057, ticks=143378/181982, in_queue=411703, util=59.16%
  sdd: ios=5314/10963, merge=156216/409569, ticks=149805/164812, in_queue=391826, util=54.74%
  sdb: ios=4582/12537, merge=154260/448047, ticks=146637/210533, in_queue=441190, util=60.62%
  sdi: ios=4071/11036, merge=118904/444734, ticks=129044/158816, in_queue=374238, util=56.63%
  sdg: ios=3982/11256, merge=145162/402120, ticks=123374/154464, in_queue=358048, util=56.58%
  sde: ios=5342/11222, merge=159252/396654, ticks=149011/142698, in_queue=370564, util=56.42%
  sdc: ios=5294/11646, merge=157321/435400, ticks=174644/209050, in_queue=472214, util=63.27%
  sdh: ios=4712/10682, merge=147718/394933, ticks=177578/237336, in_queue=507469, util=65.39%